{"lyrics": "\"The Other Side Of The Door\"\nIn the heat of the fight I walked away\nIgnoring words that you were saying\nTrying to make me stay\nI said, \"This time I've had enough.\"\nAnd you've called a hundred times\nBut I'm not picking up\n'Cause I'm so mad I might tell you that it's over\nBut if you look a little closer\nI said, \"Leave,\" but all I really want is you\nTo stand outside my window throwing pebbles\nScreaming, \"I'm in love with you.\"\nWait there in the pouring rain, come back for more\nAnd don't you leave 'cause I know\nAll I need is on the other side of the door\nMe and my stupid pride are sitting here alone\nGoing through the photographs, staring at the phone\nI keep going back over things we both said\nAnd I remember the slamming door and all the things that I misread\nSo babe if you know everything, tell me why you couldn't see\nWhen I left I wanted you to chase after me\nYeah, I said, \"Leave,\" but all I really want is you\nTo stand outside my window throwing pebbles\nScreaming, \"I'm in love with you.\"\nWait there in the pouring rain, come back for more\nAnd don't you leave 'cause I know\nAll I need is on the other side of the door\nAnd I'll scream out the window\nI can't even look at you\nI don't need you but I do, I do, I do\nI say, \"There's nothing you can say to make this right again.\nI mean it, I mean it.\"\nWhat I mean is...\nI said, \"Leave,\" but baby all I want is you\nTo stand outside my window throwing pebbles\nScreaming, \"I'm in love with you.\"\nWait there in the pouring rain, come back for more\nAnd don't you leave 'cause I know\nAll I need is on the other side of the door\nWith your face and the beautiful eyes\nAnd the conversation with the little white lies\nAnd the faded picture of a beautiful night\nYou carry me from your car up the stairs\nAnd I broke down crying, was she worth this mess?\nAfter everything and that little black dress\nAfter everything I must confess, I need you", "title": "The Other Side Of The Door", "year": "2008", "album": "Fearless"}