"{'album': 'Red', 'title': 'We Are Never Ever Getting Back Together', 'lyrics': '\"We Are Never Ever Getting Back Together\"\\nI remember when we broke up the first time\\nSaying, \"This is it, I\\'ve had enough,\" \\'cause like\\nWe hadn\\'t seen each other in a month\\nWhen you said you needed space. (What?)\\nThen you come around again and say\\n\"Baby, I miss you and I swear I\\'m gonna change, trust me.\"\\nRemember how that lasted for a day?\\nI say, \"I hate you,\" we break up, you call me, \"I love you.\"\\nOoh, we called it off again last night\\nBut ooh, this time I\\'m telling you, I\\'m telling you\\nWe are never ever ever getting back together,\\nWe are never ever ever getting back together,\\nYou go talk to your friends, talk to my friends, talk to me\\nBut we are never ever ever ever getting back together\\nLike, ever...\\nI\\'m really gonna miss you picking fights\\nAnd me falling for it screaming that I\\'m right\\nAnd you would hide away and find your peace of mind\\nWith some indie record that\\'s much cooler than mine\\nOoh, you called me up again tonight\\nBut ooh, this time I\\'m telling you, I\\'m telling you\\nWe are never, ever, ever getting back together\\nWe are never, ever, ever getting back together\\nYou go talk to your friends, talk to my friends, talk to me (talk to me)\\nBut we are never ever ever ever getting back together\\nOoh, yeah, ooh yeah, ooh yeah\\nOh oh oh\\nI used to think that we were forever ever\\nAnd I used to say, \"Never say never...\"\\nUggg... so he calls me up and he\\'s like, \"I still love you,\"\\nAnd I\\'m like... \"I just... I mean this is exhausting, you know, like,\\nWe are never getting back together. Like, ever\"\\nNo!\\nWe are never ever ever getting back together\\nWe are never ever ever getting back together\\nYou go talk to your friends, talk to my friends, talk to me\\nBut we are never ever ever ever getting back together\\nWe, ooh, getting back together, ohhh,\\nWe, ooh, getting back together\\nYou go talk to your friends, talk to my friends, talk to me (talk to me)\\nBut we are never ever ever ever getting back together', 'year': '2012'}"