{"lyrics": "\"Drops Of Jupiter\"\n(originally by Train)\n[Spoken:] You know you guys have a lot of amazing bands from this part of the world, did you know that?\nWell now he's back in the atmosphere\nWith Drops of Jupiter in his hair, hey, hey\nHe walks like summer and talks like rain\nReminds me that there's time to change, hey, hey\nSince his return from the stay on the moon\nHe listens like spring and he talks like June, hey, hey \nTell me did you sail across the sun\nDid you make it to the Milky Way to see the lights all faded\nThat heaven is overrated \nTell me, did you fall for a shooting star\nOne without a permanent scar\nAnd did you miss me while you were looking for yourself out there \nWell now he's back from that soul vacation\nChasing his way through the constellation, hey, hey\nHe checks out Mozart while he does tae-bo\nReminds me that there's room to grow, hey, hey \nWell now he's back in the atmosphere\nI'm afraid that he might think of me as plain ol' Jane\nTold a story about a man who is too afraid to fly so he never did land \nTell me did the wind sweep you off your feet\nDid you finally get the chance to dance along in the light of day\nHead back to the Milky Way\nAnd tell me, did Venus blow your mind\nWas it everything you wanted to find\nAnd did you miss me while you were looking for yourself out there \nCan you imagine no love, pride, deep-fried chicken\nYour best friend always sticking up for you, even when I know you're wrong\nCan you imagine no first dance, freeze dried romance five-hour phone conversation\nThe best soy latte that you ever had. . .and me.\nTell me, did the wind sweep you off your feet\nDid you finally get the chance to dance along in the light of day\nHead back toward the Milky Way\nTell me, did you fall for a shooting star\nOne without a permanent scar\nAnd did you miss me while you were looking for yourself?\nNa na na na na na na na na na na na naaa, oh oh ohhh\nNa na na na na na na na na na na na naaa, oh oh ohhh\nCan you imagine no love, pride, deep-fried chicken\nYour best friend always sticking up for you, even when I know you're wrong.\nCan you imagine no first dance, freeze dried romance five-hour phone conversation\nThe best soy latte that you ever had. . .and me.", "title": "Drops Of Jupiter", "year": null, "album": null}