{"lyrics": "Uh, oh, oh\nUh, oh, oh\nYou were in college working part time waiting tables\nLeft a small town, never looked back\nI was a flight risk with a fear of fallin’\nWondering why we bother with love if it never lasts\nI say, \"Can you believe it?\"\nAs we’re lying on the couch\nThe moment I can see it.\nYes, yes, I can see it now.\nDo you remember, we were sitting there by the water?\nYou put your arm around me for the first time.\nYou made a rebel of a careless man’s careful daughter.\nYou are the best thing that’s ever been mine.\nFlash forward and we’re taking on the world together,\nAnd there’s a drawer of my things at your place.\nYou learn my secrets and you figure out why I’m guarded,\nYou say we’ll never make my parents’ mistakes.\nBut we got bills to pay,\nWe got nothing figured out,\nWhen it was hard to take,\nYes, yes, this is what I thought about.\nDo you remember, we were sitting there by the water?\nYou put your arm around me for the first time\nYou made a rebel of a careless man’s careful daughter\nYou are the best thing that’s ever been mine.\nDo you remember all the city lights on the water?\nYou saw me start to believe for the first time\nYou made a rebel of a careless man’s careful daughter\nYou are the best thing that’s ever been mine.\nOh, oh, oh, oh\nAnd I remember that fight\nTwo-thirty AM\nAs everything was slipping right out of our hands\nI ran out crying and you followed me out into the street\nBraced myself for the \"Goodbye.\"\n‘Cause that’s all I’ve ever known\nThen you took me by surprise\nYou said, \"I’ll never leave you alone.\"\nYou said, \"I remember how we felt sitting by the water.\nAnd every time I look at you, it’s like the first time.\nI fell in love with a careless man’s careful daughter.\nShe is the best thing that’s ever been mine.\"\nHold on, make it last\nHold on, never turn back\nYou made a rebel of a careless man’s careful daughter\nYou are the best thing that’s ever been mine.\n(Hold on) do you believe it?\n(Hold on) we're gonna make it now.\n(Hold on) and I can see it,\n(Yes, yes) I can see it now (see it now, see it now...)", "title": "Mine", "album": "Speak Now", "year": "2010"}