{"year": "2011", "lyrics": "I wake up fine and dandy but then by the time I find it handy,\nTo rip my heart apart and start planning my crash landing,\nI go up, up, up, up, up to the ceiling,\nThen I feel my soul start leaving, like an old man's hair receding,\nI'm pleading please, oh please on my knees repeatedly asking,\nWhy it's got to be like this. Is this living free?\nI don't want to be the one, be the one who has the sun's blood on my hands,\nI'll tell the moon, take this weapon forged in darkness,\nSome see a pen, I see a harpoon.\nI'll stay awake,\n'Cause the dark's not taking prisoners tonight.\nWhy am I not scared in the morning?\nI don't hear those voices calling,\nI must have kicked them out, I must have kicked them out,\nI swear I heard demons yelling,\nThose crazy words they were spelling,\nThey told me I was gone, they told me I was gone.\nBut I'll tell them,\nWhy won't you let me go?\nDo I threaten all your plans?\nI'm insignificant.\nPlease tell them you have no plans for me.\nI will set my soul on fire, what have I become?\nI'll tell them.\nOn the eve of a day that's forgotten and fake,\nAnd the trees they await and clouds anticipate,\nThe start of a day when we put on our face,\nA mask that portrays that we don't need grace,\nOn the eve of a day that is bigger than us,\nBut we open our eyes 'cause we're told that we must,\nAnd the trees wave their arms and the clouds try to plead,\nDesperately yelling there's something we need,\nI'm not free, I asked forgiveness three times,\nSame amount that I denied, I three-time mvp'ed this crime,\nI'm afraid to tell you who I adore, won't tell you who I'm singing towards,\nMetaphorically I'm a whore, and that's denial number four.\nI'll stay awake,\n'Cause the dark's not taking prisoners tonight.\nWhy am I not scared in the morning?\nI don't hear those voices calling,\nI must have kicked them out, I must have kicked them out,\nI swear I heard demons yelling,\nThose crazy words they were spelling,\nThey told me I was gone, they told me I was gone.\nBut I'll tell them,\nWhy won't you let me go?\nDo I threaten all your plans?\nI'm insignificant,\nPlease tell them, you have no plans for me,\nI will set my soul on fire, what have I become?\nI'll tell them, you have no plans for me,\nI will set my soul on fire,\nWhat have I become?\nI'll tell them,\nI'll tell them,\nI'll tell them,\nI'll tell them,\nPlease tell them, you have no plans for me,\nI will set my soul on fire, what have I become?\nI'm sorry.", "title": "Ode To Sleep", "album": "Regional At Best"}