{"album": "Vessel", "year": "2013", "lyrics": "\"Migraine\"\nAm I the only one I know,\nWaging my wars behind my face and above my throat?\nShadows will scream that I'm alone.\nI-I-I I've got a migraine\nAnd my pain will range from up, down, and sideways,\nThank God it's Friday\n'Cause Fridays will always be better than Sundays\n'Cause Sundays are my suicide days,\nI don't know why they always seem so dismal,\nThunderstorms, clouds, snow, and a slight drizzle,\nWhether it's the weather or the letters by my bed,\nSometimes death seems better than the migraine in my head,\nLet it be said what the headache represents,\nIt's me defending in suspense,\nIt's me suspended in a defenseless test\nBeing tested by a ruthless examiner\nThat's represented best by my depressing thoughts,\nI do not have writer's block,\nMy writer just hates the clock,\nIt will not let me sleep, I guess I'll sleep when I'm dead,\nAnd sometimes death seems better than the migraine in my head.\nAm I the only one I know\nWaging my wars behind my face and above my throat?\nShadows will scream that I'm alone,\nBut I know we've made it this far, kid.\nYeah, yeah, yeah\nI am not as fine as I seem, pardon\nMe for yelling, I'm telling you green gardens\nAre not what's growing in my psyche, it's a different me,\nA difficult beast feasting on burnt-down trees\nFreeze frame please, let me paint a mental picture portrait,\nSomething you won't forget, it's all about my forehead,\nAnd how it is a door that holds back contents,\nThat make Pandora's Box's contents look non-violent,\nBehind my eyelids are islands of violence,\nMy mind's ship-wrecked,\nThis is the only land my mind could find,\nI did not know it was such a violent island,\nFull of tidal waves, suicidal crazed lions,\nThey're trying to eat me, blood running down their chin,\nAnd I know that I can fight or I can let the lion win,\nI begin to assemble what weapons I can find,\n'Cause sometimes to stay alive you gotta kill your mind.\nAm I the only one I know\nWaging my wars behind my face and above my throat?\nShadows will scream that I'm alone,\nBut I know we've made it this far, kid.\nAh, yeah\nYeah, yeah, yeah\nOh, oh\nYeah, yeah, yeah\nAnd I will say that we should take a day to break away\nFrom all the pain our brain has made,\nThe game is not played alone.\nAnd I will say that we should take a moment and hold it,\nAnd keep it frozen and know that\nLife has a hopeful undertone.\nAnd I will say that we should take a day to break away\nFrom all the pain our brain has made,\nThe game is not played alone.\nAnd I will say that we should take a moment and hold it,\nAnd keep it frozen and know that\nLife has a hopeful undertone.\nAm I the only one I know\nWaging my wars behind my face and above my throat?\nShadows will scream that I'm alone,\nBut I know we've made it this far, kid.\nWe've made it this far\nWe've made it this f...", "title": "Migraine"}